Repository: magi1125/inclusive-design-pattern
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Setting paragraphs’ measure directly is unwise, since in responsive and modular layouts they should wrap according to their containing element.
ja: パラグラフのカラム幅を直接設定するのは賢い方法ではありません。レスポンシブなモジュール式のレイアウトでは、コンテナ要素の幅に応じて改行されるようにする必要があるためです。

source: Should a <subtitle> element ever be specified, the clarifying “Subtitle:” prefix would probably be provided for you as a feature of the element’s role, and therefore automatically available in the “accessibility tree5” — the version of the DOM used by assistive technologies where roles, properties, states, labels and values are exposed.
ja: もし<subtitle>要素が定義されたなら、この要素のロールが持つ機能として「サブタイトル：」という接頭辞を提供して、意味を明確にするようになるかもしれません。接頭辞は自動的に「アクセシビリティツリー」（脚注40）――DOMに役割(role)、プロパティ、状態(state)、ラベル、値などの情報を加え、支援技術に提供できるようにしたもの――に追加され、支援技術から利用できるようになるでしょう。

source: Should you wish to adopt a framework or employ a preprocessor to speed up your development process, be my guest.
ja: もし、フレームワークやプリプロセッサを利用して開発プロセスのスピードアップを図りたいと思う方がいらっしゃれば、それはご自由にどうぞ。

source: Shows how heading navigation bypasses section content that precedes sections’ headings.
ja: スクリーンリーダーの見出しナビゲーションがセクション見出しの前にあるコンテンツをスキップしている様子。

source: Shows stages in progressive enhancement.
ja: プログレッシブエンハンスメントの段階を示す図。

source: Simple interfaces are usable interfaces, and much less work in terms of managing breakpoints.
ja: シンプルなインターフェイスは使いやすい上に、ブレイクポイントの管理の手間がはるかに少なくて済みます。

source: Simple user interfaces are usable interfaces, accessible interfaces, maintainable interfaces, and performant interfaces.
ja: シンプルなユーザーインターフェイスこそが、ユーザブルなインターフェイスであり、アクセシブルなインターフェイスであり、メンテナブルなインターフェイスであり、ハイパフォーマンスなインターフェイスなのです。

source: Since <main> is designed to contain the salient content of a page, it can make the writing of a print style sheet easier.
ja: <main>にページの主要コンテンツを入れる設計になったことで、印刷用スタイルシートを簡単に書けるようになりました。

source: Since an underline tends to sit directly below the typeface’s baseline, it cuts through the descenders of letterforms like g and j, diminishing the readability of linked text.
ja: アンダーラインは書体のベースラインのすぐ下につくことが多いため、gやjなどの文字のディセンダをアンダーラインが横切り、リンクテキストが読みにくくなることがあります。

source: Since it’s easy to become wedded to brand colors early in a project, instead of testing color contrast after the fact, I recommend designing an accessible color scheme from the outset.
ja: プロジェクトの初期段階ではブランドカラーに縛られやすいため、作成後に色のコントラストをテストするのではなく、最初からアクセシブルなカラースキームをデザインすることをお勧めします。

source: Since it’s the singular child of <main>, it would take the user to the same place anyway.
ja: <main>の単一の子要素になっているため、いずれにしてもユーザーは同じ場所に移動することになります。

source: Single-page applications are typified by their use of client-side JavaScript to render and rerender content.
ja: シングルページアプリケーションには、クライアントサイドJavaScriptを使用してコンテンツの表示と再描画を行うという特徴があります。

source: Skip Links
ja: スキップリンク

source: Skip links are a classic allowance made in the name of inclusive design: they feel like an awful cludge, but their impact on the experience of some types of users is tried and tested.
ja: スキップリンクは、インクルーシブデザインの名で作られた古典的なものです。その場しのぎの解決策に思えるかもしれませんが、一部のユーザーの体験に及ぼす効果は実証済みです。

source: Skip links should not appear visually by default because they have very limited utility to mouse and touch users and would only serve to confound them.
ja: ただし、スキップリンクはデフォルトでは表示されないようにすべきです。マウスユーザーやタッチデバイスのユーザーにとっては非常に使いにくく、混乱を招くだけだからです。

source: So are keyboards, touch displays, refreshable braille displays and keyboards, joysticks16 and switches17.
ja: その他には、キーボード、タッチディスプレイ、点字ディスプレイおよびキーボード、ジョイスティック（脚注30）、スイッチ（脚注31）などがあります。

source: So, 100% is really “one hundred percent of the default size or the size the user has chosen.” If I were to set the font size explicitly as 16px at the root level, I would diminish the user’s ability to adjust font size to their liking.
ja: つまり、この100%は「デフォルトサイズまたはユーザーが選択したサイズの100%」を意味します。一方、ルートレベルでフォントサイズを明示的に16pxに設定した場合は、ユーザー側でフォントサイズを自由に調整できなくなります。

source: Some developers handle heading styles separately using CSS classes.
ja: CSSクラスを使うことで、見出しのスタイルを分離して処理する開発者もいます。

source: Some patterns in this book, like navigation regions, should appear consistently between pages of the site as landmarks.
ja: 本書で扱うパターンのうち、ナビゲーション領域などは、サイトの各ページにランドマークとして常に表示させるべきものです。

source: Some say [a picture paints a thousand words], but I prefer the contrary expression: "“Never send a picture to do the job of words.” Text is the most direct and efficient way of communicating information and — though imagery and other media have supplemental value for those who learn better visually or have literacy issues — it should be treated as primary.
ja: 「一枚の絵は千の言葉に値する」と言う人もいますが、私はその反対の「絵に言葉の仕事をさせてはならない」という表現の方が好きです。テキストは、情報を伝えるのに最も直接的で効果的な方法であり――ただし、学習障害のある人や読み書きが困難な人にとっては、画像やその他の媒体にはテキストにない価値がありますが――、第一の手段として扱うべきです。

source: Sometimes they may be the technically correct element to use, but they’re not supported in any way so have no impact on anyone.
ja: 技術的に正しい要素を使用していても、それが全くサポートされておらず、誰が見ても何の効果も発揮しないことがあります。

source: Source order is an important dimension of structure and our blog article should make sense read from top to bottom.
ja: ソースの順序は構造の重要な側面であり、ブログ記事は上から下に読んで意味が通らなくてはなりません。

source: Subsections
ja: サブセクション

source: Subsetting Fonts
ja: フォントのサブセット化

source: Subtitles
ja: サブタイトル

source: Such people are not afforded the same shortcuts as screen reader operators, so it’s them we’re mostly helping to skip over navigation and other header content.
ja: 目が見えているキーボードユーザーには、スクリーンリーダーのようなショートカットの機能が提供されていません。ナビゲーションや他のヘッダーコンテンツをスキップする機能は、彼らのためのものなのです。

source: Sufferers of scotopic sensitivity syndrome14 (or Irlen syndrome) are sensitive to glare, and stark contrast can result in blurred text or text that appears to move around.
ja: 光感受性症候群（脚注28） (アーレン症候群とも呼ばれます) の人はまぶしさに敏感で、コントラストが強いとテキストがぼやけたり、動き回っているように見えることがあります。

source: Summary
ja: まとめ

source: Sure, but generous font sizes don’t offend young, keen-eyed folks.
ja: なるほど、そうかもしれません。しかし、フォントサイズが大きめだからと言って、若くて眼力の鋭いユーザーが気分を害するとは思えません。

source: Tabbing again will hide the skip link and focus on the next interactive element on the page (probably the homepage link or the first link in the navigation list).
ja: そしてもう一度Tabキーを押すとスキップリンクは非表示になり、ページ内の次のインタラクティブ要素（たいていはホームページへのリンクやナビゲーションリストの最初のリンク）にフォーカスが移ります。

source: Take the following heading as an example:
ja: 例として以下の見出しを見てみましょう。

source: Targeting the specific viewports of specific devices (employing device breakpoints) is an exercise in futility if you want to create a truly inclusive experience.
ja: 真にインクルーシブな体験を作りたいなら、特定のデバイスの特定のビューポートを想定する（デバイスのビューポートのサイズをブレイクポイントとして採用する）のは無駄が多すぎます。

source: Thank you.
ja: ご協力に感謝します。

source: Thanks to standard browser behavior, any <a> element with an href attribute which is the next focusable element within the document will gain focus when the user hits the Tab key.
ja: ブラウザの標準の動作のおかげで、ユーザーがTabキーを押すと、ドキュメント内で次にフォーカス可能な要素である、href属性を持つ<a>要素にフォーカスが移動します。

source: That does not mean the second structure is not preferable.
ja: だからといって最初のコード例のほうが好ましいということではありませんので注意してください。

source: That doesn’t mean you need a breakpoint for every width.
ja: ただしそれは、1つのブレイクポイントですべての幅に対応しなければならないということではありません。

source: That is, 1em + (0 × 1vw) is still 1em.
ja: つまり、1em + (0× 1vw) となっても1emを確保できるということです。

source: That is, if <html lang="en"> is present but the text is actually in French, you’d hear a voice profile called Jack doing a bad impression of French, rather than a French profile called Jaques using authentic French pronunciation.
ja: つまり、もし<htmllang="en">が存在するのにテキストが実際にはフランス語である場合、Jaquesと呼ばれるフランス語の音声プロファイルが流暢なフランス語の発音で読むべきところで、Jackという英語のプロファイルによる下手なフランス人のものまねを聞かされる羽目になります。

source: That is, reading from the previous section into this one, you’d have a good idea of what is free.
ja: つまり、前のセクションからこのセクションへ読み進めることで、何が無料なのかが分かるはずです。

source: That is, the following code example is semantically identical to the preceding one.
ja: つまり、以下のコード例は、セマンティック的には前のコードと同じです。

source: That just leaves adding some hidden text to also inform screen reader users that the link is external.
ja: あとは、リンクが外部であることをスクリーンリーダーのユーザーに知らせる、隠しテキストを追加するだけです。

source: That’s because bright light has a habit of triggering migraines for me.
ja: 私は明るい光を見ると片頭痛になるのです。

source: That’s not to say you shouldn’t use <section> or <article>, but the information they provide does not serve this particular purpose.
ja: <section>や<article>は使用すべきでないとは言いませんが、これらが提供する情報では目的を果たせません。

source: That’s pretty uninclusive of users on temperamental networks.
ja: これでは、回線が不安定なユーザーにとってはとてもインクルーシブとは言えません。

source: That’s ultimately what HTML is for: forming structure through differentiation.
ja: HTMLの最終的な目的は、要素の識別を通じて構造化することですから。

source: That’s what it is, after all!
ja: 結局のところ、それが何であるのか、なのです！

source: The lang attribute can be used to improve the readability, translatability and compatibility of web documents’ written content, helping open it up to an international audience.
ja: lang属性は、Webドキュメントに書かれたコンテンツの読みやすさ、翻訳のしやすさ、互換性を向上させて、世界中の人に開かれたものにすることができるのです。

source: The viewport meta tag is where responsive design is, somewhat magically, enabled.
ja: viewportメタタグを置くことで、魔法のようにレスポンシブデザインが有効になります。

source: The .visually-hidden class invokes a special set of properties, carefully devised to hide the element visually without it becoming silenced in screen reader software.
ja: この.visually-hiddenクラスには専用のCSSプロパティが定義されており、視覚的には要素を巧みに隠しつつ、スクリーンリーダーでは読み上げられるようにしています。

source: The <article> Element
ja: <article>要素

source: The Element
ja: 要素

source: The element represents your document’s first-level heading.
ja: 要素は、ドキュメントの第1レベルの見出しを表します。

source: The <main> Element
ja: <main> 要素

source: The <main> element defines a region recognized and communicated by screen readers.
ja: <main>要素で定義された領域は、スクリーンリーダーに認識され、通知されます。

source: The <title> Element
ja: <title> 要素

source: The <title> element, found in the <head>, should be familiar to you already as the element browsers glean the text from for their tab labeling, and search engines the text for their results links.
ja: <title>要素は<head>要素の中にあり、皆さんもよくご存じのように、ブラウザはこのテキストをタブのラベルとして使います。また、検索エンジンは、検索結果のリンクにこのテキストを使います。

source: The <title> is announced as soon as a new web document is loaded, so it is your opportunity to provide a succinct summary of the page.
ja: <title>は新たにWebドキュメントが読み込まれるとすぐに読み上げられるため、ページの概要を示すのに最適です。

source: The Flesch reading ease test gives you a score between 0 and 100 where a higher score means more easily readable and, therefore, more inclusive of different readers.
ja: Flesch Reading Easeテストでは、0～100点で評価されます。得点が高いほど読みやすい、つまり、多様な読者に対して、よりインクルーシブであるという意味です。

source: The 2 in says “two levels deep,” or “one down from the first level.” Visually, headings are conventionally differentiated by font size: the deeper the level, the smaller the font-size.
ja: の2が意味しているのは、「レベル2の深さ」つまり「第1レベルからひとつ下がったレベル」ということです。視覚的には、見出しはフォントサイズで区別されるのが慣習となっており、レベルが深いほど font-sizeは小さくなります。

source: The text effectively labels the supersection that is the document body, so it’s not logical to have more than one per page.
ja: テキストは実質的に、ドキュメントの本文である最上位セクションのラベルとなります。このため、1ページに複数あるのは論理的に正しくありません。

source: The Flesch-Kincaid grade level test is similar but produces a US school grade level.
ja: Flesch- Kincaid Grade Levelテストもこれと似ていますが、評価結果は米国の学校の学年として表現されます。

source: The Doctype
ja: DOCTYPE

source: The Document
ja: ドキュメント全体

source: The HTML5 outline algorithm was specified to automate section structure based on sectioning elements, removing the need for –.
ja: HTML5のアウトラインアルゴリズムは、セクショニング要素に基づいてセクションの構造を自動化し、～を不要にするよう設計されていました。

source: The JAWS screen reader (and only the JAWS screen reader) announces “Article” on entering the element and “Article end” on exiting it.
ja: スクリーンリーダーのJAWSは（そしてJAWSだけが）、この要素に入るときに「アーティクル開始」、出るときに「アーティクル終了」と読み上げます。

source: The Typeface
ja: 書体

source: The accessible name for a document, <iframe> or embedded SVG element is provided by their <title>.
ja: ドキュメントや<iframe>、埋め込みのSVG要素では、それぞれに指定された<title>がアクセシブルな名前 (name) となります。

source: The aim here is not to go in search of the ultimate boilerplate but to configure a parent web page for an inclusive interface.
ja: この章の目的は、究極のひな形を探し求めることではなく、インクルーシブなインターフェイスの親となるWebページを適切な設定にすることです。

source: The answer is: probably not, but maybe.
ja: その答えはこうなります。「おそらくそうではありませんが、もしかするとそうかもしれません。」

source: The article uses bandwidth as another exemplar: a web app that’s performant on the most unreliable mobile network is, therefore, performant everywhere.
ja: この記事では、もうひとつの例として帯域幅を取り上げ、最も信頼性が低いモバイルネットワーク上で高い性能を発揮できるWebアプリケーションは、どこでも高い性能を発揮できるとしています。

source: The base64-encoded font would be included inside an @font-face declaration block, like so:
ja: Base64でエンコードしたフォントは@font-face宣言ブロックで以下のように指定します。

source: The basic dotted outline focus style compared with a blue background focus style.
ja: 基本的な点線のアウトラインによるフォーカススタイルと、青い背景のフォーカススタイルの比較。

source: The characters d and b in two sets.
ja: dとbの文字のセットが2つ並んでいる。

source: The clue is in the “DOC” part which should appear in the first line of code: <!DOCTYPE html>.
ja: その証拠に、コードの先頭の行には "DOC" という文字列が出現します。<!DOCTYPE html> ですね。

source: The concept of main content is not a new one, but it is only recently that we’ve been afforded a tool to inclusively separate it from surrounding page apparatus like headers, navigation regions and footers.
ja: メインコンテンツという考え方自体は新しくはありませんが、メインコンテンツをヘッダー、ナビゲーション領域、フッターなどからインクルーシブに切り離せるようになったのは、つい最近のことです。

source: The difference in file size between an entire font and one subsetted to just the ampersand glyph you want will be many orders of magnitude!
ja: フォント全体のファイルサイズと、必要な文字、たとえばアンパサンド記号（&）のみをサブセット化した場合のファイルサイズは、それこそ桁違いです！

source: The element helps us to think about what the main content of our page actually is, and can later be used as a navigational aid by screen reader operators.
ja: この要素は、そのページの実際のメインコンテンツは何であるかについて考えるのに役立ちます。また、後でスクリーンリーダーユーザーがナビゲーション手段として利用することもできます。

source: The fewer decisions you make for them, the more they can make for themselves.
ja: デザイナーが決めることが少ないほど、ユーザーが決められることが多くなります。

source: The first shows that people on poor networks are a subgroup of people who benefit from performant websites.
ja: 1つめのベン図は、低質なネットワークを利用している人は、高性能Webサイトのメリットを享受する人の部分集合であることを示している。

source: The first step is to identify which links qualify as external.
ja: 最初のステップは、どのリンクが外部リンクかを特定することです。

source: The following markup is serviceable for a blog’s homepage, where multiple recent posts are listed.
ja: 以下のマークアップは、ブログのホームページの、最近の記事が複数リストされるところで役立ちます。

source: The gradient version pairs blue text with a gray underline.
ja: グラデーション版は、青い文字とグレーのアンダーラインの組み合わせになっている。

source: The idea is that the younger the audience who can successfully read it, the more readable it is.
ja: より若い読者が読めるほど、より読みやすいという考え方です。

source: The key to inclusive design isn’t to target specific groups, it’s to not exclude groups arbitrarily — there’s nothing to gain.
ja: インクルーシブデザインで重要なのは、特定の層をターゲットにすることではなく、特定の層を恣意的に排除しないことです。特定の層を排除しても、得るものは何一つありません。

source: The lang Attribute
ja: lang属性

source: The left one has a comfortable line height.
ja: 左は読みやすい行の高さになっている。

source: The middle subsection is labeled missing.
ja: 中間のサブセクションには「欠けているサブセクション」というラベルがついている。

source: The only modern browser that does not support viewport units at the time of writing is Opera Mini.
ja: 本書の執筆時点で、ビューポートの単位をサポートしていないモダンブラウザはOpera Miniだけです。

source: The previous example could be rewritten to take the title “How To Mark Up Blog Articles” and the subtitle “In Seven Simple Steps.” The question is how to mark this up.
ja: 前の例を書き直して、タイトルを「ブログ記事のマークアップ方法」とし、サブタイトルを「～シンプルな7つのステップで～」とすることを考えてみましょう。問題はこれをどのようにマークアップするかです。

source: The principal beneficiaries of skip links are sighted keyboard users.
ja: スキップリンクの恩恵を最も受けるのは、目が見えているキーボードユーザーです。

source: The rem unit causes problems in Safari, as “PX, EM or REM Media Queries?5” by Zell Liew attests.)
ja: ゼル・リュウ（Zell Liew）が「PX, EM or REM Media Queries?（脚注8）」で実証しているように、remではSafariで問題が起きます。

source: The responsive design mode interface displays the current dimensions, allowing you to record and attend to that breakpoint.
ja: このとき、レスポンシブデザインモードのインターフェイスに現在のサイズが表示されるため、これを記録すれば、そのブレイクポイントがわかります。

source: The right one has the same line height but with larger letterforms, forcing each line to overlap.
ja: 右は、行の高さは同じだが文字が大きいため、各行が重なってしまっている。

source: The second shows that people with visual dyslexia are a subgroup of people who benefit from readable fonts.
ja: 2つめのベン図は、ディスレクシアの人は、読みやすいフォントのメリットを享受する人の部分集合であることを示している。

source: The sound semantic structure we’ve been fostering in our blog article doesn’t just benefit screen reader users.
ja: ここまでにブログ記事で作り上げてきた、音として聞こえるセマンティック構造は、スクリーンリーダーユーザーにのみメリットをもたらすわけではありません。

source: The source code is just more complex.
ja: ただソースコードが複雑になっているにすぎません。

source: The standard text decoration underline compared with the superior gradient technique.
ja: 標準的なtext-decorationのアンダーラインと、優れたグラデーションテクニックの比較。

source: The subject of focus styles will come up in many patterns to follow, as more and different interactive elements are added to our vocabulary.
ja: フォーカススタイルの課題は、インタラクティブな要素の数や種類が増えるにつれ、今後もさまざまな形で現れてくることでしょう。

source: The trick is to embrace convention without dispensing with personality.
ja: 秘訣は、個性を失わずに、慣習を取り入れることです。

source: The trick is to load the page then the font, using the onload event as a watershed.
ja: ポイントは、先にページを読み込んでから、onloadイベントを分岐点にしてフォントを読み込むようにすることです。

source: Then yes, please!</h2>
ja: それならください！</h2>

source: Then you get CSS, but the content remains.
ja: 次にCSSを取得するが、コンテンツは維持される。

source: Theoretically, the <article> should start a new subsection by deferring to the HTML5 outline algorithm6.
ja: 理論上は、<article>があれば、HTML5のアウトラインアルゴリズム（脚注41）に従って、新しいサブセクションが始まるべきです。

source: There are a number of tools to test your content against Flesch-Kincaid, including the TRAY readability tool15 (a Chrome browser extension) or, if you want something to run from the command line, I’ve created Readability Checker CLI16 — a Node.js CLI (command line interface).
ja: TRAYリーダビリティツール（脚注48）（Chromeブラウザ拡張）など、Flesch-Kincaidを基準としてコンテンツをテストするツールはいくつかあります。コマンドラインからテストを実行したい場合には、私が作成したReadability Checker CLI（脚注49）――Node.js CLI（コマンドラインインターフェイス）があります。

source: There are just too many viewport variations available to support each one.
ja: それぞれのデバイスに対応するには、あまりにもビューポートのバリエーションが多すぎるのです。

source: There are two tests you can perform on your content which assess word, sentence and paragraph length to determine the readability of your text.
ja: 単語、文章、パラグラフの長さを評価してテキストの読みやすさを判定するテストが2種類あります。

source: There is a lot of conflicting advice on what the characteristics of a readable body text typeface should be.
ja: 本文テキストをどのような書体にすると読みやすいかについては、相反する多数の意見があります。

source: There is a lot of confusion surrounding HTML5 sectioning elements.
ja: HTML5のセクショニング要素については多くの混乱があります。

source: There is a rationale for reasonably large defaults: anything else risks alienating a huge swath of users, many from older populations whose eyesight has deteriorated.
ja: デフォルトが大きめなのには理由があります。他のサイズでは、特に視力が低下した高齢者など、さまざまなユーザーを遠ざけてしまう恐れがあるからです。

source: Therefore, when designing for that artificial individual we create something that doesn’t fit anyone’s needs.” – “Designing for the extremes4,” Susana Gonzalez Ruiz
ja: この作り物の個体に合わせてデザインするということは、誰のニーズにも合わないものを作っているということです」 —「Designing for the extremes」、スサーナ・ゴンザレス・ルイス（Susana Gonzalez Ruiz）

source: Therefore, your prototypes and minimum viable product should contain real and preferably well-considered copy, ready to be tested with your users.
ja: したがって、プロトタイプおよび実用最小限のプロダクトは、実際の、できれば十分に練られたコピーを含み、ユーザーがテストできる状態になっているべきです。

source: There’s also a specific implication for screen reader users: screen readers tend to catalog headings dynamically and offer them as a list to choose from.
ja: さらに、スクリーンリーダーユーザーにとってはある意味合いがあります。スクリーンリーダーは、動的に見出しをカタログ化し、選択できるリストとして提供します。

source: There’s no need to say the convoluted, “a pork pie was eaten by Harry” when you can just as well say, “Harry ate a pork pie.”
ja: 回りくどく言う必要はありません。「ハリーがポークパイを食べた」と言えるのに、「ポークパイがハリーに食べられた」とする必要はありません。

source: These are the assistive technology compatible labels for the various elements of your web pages.
ja: これは支援技術とも互換性のあるラベルで、Webページのさまざまな要素に適用できます。

source: These provisions, according to Bigelow and others, are likely more important than the choice of font (unless the font is eye-wateringly illegible, of course).
ja: ビゲロウなどによると、これらの対策はフォントの選択よりもさらに大切であるようです（もちろん涙が出るほど読みにくいフォントでなければの話です）。

source: These should have a text-decoration fallback:
ja: 以下のようにtext-decorationによるフォールバックで対応するべきでしょう。

source: They can often be replaced by a more direct alternative.
ja: 多くの場合、より直接的な表現に書き換えることができます。

source: They lead you to build poor products.
ja: そのようなフレームワークでは、残念な製品ができてしまうことになるでしょう。

source: They’ll be too busy effortlessly digesting your content.
ja: 彼らはコンテンツから情報を得るのに忙しいはずですから。

source: They’re typically rather large assets themselves and encourage convoluted, redundant markup.
ja: 通常、それ自体が大きなアセットとなり、複雑で冗長なマークアップが増加します。

source: Things to Avoid
ja: 避けるべきこと

source: This allows the main DOM content to be rendered before the scripts are executed.
ja: これによって、スクリプトが実行される前に、メインのDOMコンテンツをレンダリングできるようになります。

source: This also applies to books…
ja: これは本にも当てはまります。

source: This applies whether you’re in the business of publishing lengthy, florid prose or dotting isolated descriptions and messages around an application.
ja: これは、美辞麗句の多い長文を公開する場合にも、アプリケーションが出す個々の説明やメッセージを各所に記述する場合にも当てはまります。

source: This book is not the place to discuss the ins and outs of responsive design, but you should be aware of some responsive design principles that support inclusive design.
ja: 本書ではレスポンシブデザインについて詳述はしませんが、ぜひ知っておきたい、インクルーシブデザインを支えるレスポンシブデザインの原則をいくつか紹介します。

source: This deceives both visual and non-visual readers because it breaks the perceived structure — a level has been skipped.
ja: これは、視覚的なユーザーと非視覚的なユーザーの両方を欺くことになります。なぜなら、知覚される構造を壊すため――レベルが1つスキップされることになるためです。

source: This gives them the freedom to change font sizes independent of semantic structure.
ja: この方法では、セマンティックな構造に依存することなく、自由にフォントサイズを変更することができます。

source: This greatly reduces the complexity of your media queries.
ja: そうすれば、メディアクエリの複雑さも大幅に軽減されます。

source: This has a useful outcome regarding media queries which augment the root font size: the measure adjusts proportionately.
ja: こうしておけば、ルートのフォントサイズを大きくするメディアクエリを適用した場合にも有効です。カラム幅がフォントサイズに比例して調整されるためです。

source: This has the added advantage of ensuring a minimum font size for the page.
ja: この方法には、ページの最小フォントサイズを確保できるというメリットもあります。

source: This is a rather unjust moniker since all fonts are styled (i.e. they have their own form).
ja: なお、「Flash of Unstyled Text」というのは理不尽な呼び方です。なぜなら、すべてのフォントはスタイルを持っている（つまり、独自の字形を持っている）からです。

source: This is achievable using the content property and a few supplementary rules to move it out of sight without affecting layout.
ja: contentプロパティを使い、レイアウトに影響せずに視界から消すためのルールを追加することで実装できます。

source: This is due to one font being intrinsically larger or smaller than the other, causing lines to wrap in different places.
ja: これはそもそも片方のフォントがもう片方のフォントより大きかったり小さかったりして、行の折り返し位置が変わるためです。

source: This is efficient and effective inclusive design.
ja: これが効果的で効率的なインクルーシブデザインです。

source: This is especially helpful to screen reader users who will have become accustomed to the current site’s features and layout.
ja: 特に、現在のサイトの機能やレイアウトに慣れているであろうスクリーンリーダーユーザーにとっては役に立ちます。

source: This is much clearer than the thin dotted outline that many browsers apply by default.
ja: この方が、多くのブラウザでデフォルトで使用される薄い点線のアウトラインよりも明確です。

source: This is where focus styles come in.
ja: そこで登場するのがフォーカスのスタイルです。

source: This is where a lot of developers make a mistake: they choose a heading element which they believe best fits the perceived importance of the section it represents.
ja: ここで、多くの開発者が過ちを犯します。そのセクションの重要性を判断して、それに最も合うように思える見出し要素を選んでしまうのです。

source: This may help us to corral the visual structure of the page, but it has no impact on the semantic structure.
ja: これはページの視覚的な構造をくくるのに役立つかもしれませんが、セマンティックな構造にはなんの効果もありません。

source: This reduces monotony, encouraging focus.
ja: 単調さが軽減し、読む人を飽きさせません。
